package ex03;
//배지수
public class Main {
	public static void main(String[] args) {
		//1. 클래스와 객체에 대해 작성하고 객체를 만들 때 사용되는 생성자에 대해서도 작성하세요
		//아는 만큼 작성(최대 5줄)
		/* 클래스란 타입이며, 여러 개의 타입과 유사한 기능을 하는 메소드를 하나의 클래스로 묶어서 필드와 메소드를 효율적으로 관리하기 위해 사용한다.
		 * 객체는 클래스명 객체명 = new 생성자()의 형태로 선언이 되는데 좌항의 클래스명 객체명은 Stack 메모리에 참조변수로 선언이 되고, 해당 부분의 실행이 종료되면 가비지 컬렉터에 의해 메모리가 해제된다.
		 * 우항의 new 는 heap 메모리에 객체를 생성하고 참조값을 가져온다. 이때 생성자는 클래스명과 동일한데 개발자가 따로 해당 클래스에 생성자를 오버로딩을 이용해 선언하지 않은 경우 컴파일러가 자동으로 기본 생성자를 생성하여
		 * 객체가 패키지에 접근할 수 있도록 해준다. 만일 개발자가 생성자를 정의한 경우에 객체를 생성할 때 필요한 인수를 전달을 해 주어야하고 생성자를 여러 개 선언한 경우에는 코드 중복을 최소화 하기 위해 this()를 이용하여
		 * 다른 오버로딩된 생성자에 값을 전달해줄 수 있다. this는 객체 자기 자신을 의미하며, 꼭 필요하지 않은 경우도 있지만 코드 가독성 향상을 위해 추가하는 것을 권장한다.
		 * 
		 * 
	  //클래스는 객체를 생성하기 위한 설계도이며 필드, 메소드, 생성자로 구성된다
      //객체는 클래스를 기반으로 생성되며, 클래스에서 정의한 필드와 메소드를 사용할 수 있다
      //생성자는 객체를 생성할 때 호출되며 필드값을 초기화하는 역할을 한다
      //생성자 이름은 클래스이름과 동일하며 반환타입을 가지지 않는다
      //생성자를 만들지 않으면 컴파일러가 기본 생성자를 만들게 된다
		 * 
		 * 
		 * 
		 * 
		 * 
		 * */
	}
}
